{
  "title": "Superman (Rebirth)",
  "description": "Ok I know you're seeing this giant wall of text and about to close the tab but I promise I wouldn't spend an hour and a half writing this shit if I didn't think this series was worth it.\ntrust me on this one.\n \n \nSome background info:\nOk so, Flashpoint (by Geoff Johns). Barry Allen the Flash goes back in time and makes his mom not die. \"oops i accidentally made the world all fucked up,\" he fixes it, \"oops I accidentally rebooted the universe\"\n\"my bad\" -Barry, probably\nThis leads into the New 52, with everyone going back to square one but noticeably edgier (unless you're Scott Snyder or Geoff Johns, then it's business as usual).\nOne hero that got hit hard by the Edge was Superman. His parents are dead, he's fucking Wonder Woman instead of Lois, he's kind of an asshole, oh no. Everyone, including writers appearently, hated him so much that they made an event to fix him: Convergence.\nConvergence is very long and nobody likes it. I have not read Convergence. The following is summarized from the wikipedia page. Basically, pre-N52 Brainiac wants to learn the history of the multiverse after surviving Flashpoint but got fucked up by \"the effects of the previous crises(TM)\" (Crises, are DC's big multiverse changing events and usually have \"Crisis\" in the title [i say USUALLY because events like Flashpoint don't have it and effects the multiverse a bunch, but titles like Heroes in Crisis and Identity Crisis have it when they're just murder mysteries. comics are kinda dumb]) and took people and locations from done timelines and puts them on a planet outside of time and space. The important ones to us are Superman and Lois Lane from P-N52 who have a baby named Jon during the event; he doesn't have powers yet. After some plot, Brainiac is freed from those effects or whatever and is like \"damn, I fucked up. I can take you back to your universes but you guys gotta undo Crisis on Infinite Earths(TM) before I can\" so a few heroes go do that. When they do, it brings back those universes, including P-N52, but nobody writes about P-N52 and they get merged or something later anyway. Superman and Lois ask Brainiac \"hey can we just stay in New 52? seems kinda cool\" and he's like \"yea sure\" and they're the only ones from P-N52 in the N52. Brainiac sends them back to the 'start' of N52 (Justice League 2011 #1) and now you're ready for the prequels. oh yeah there's two volumes you gotta read before the main run (0.1 and 0.2), they take place in N52 before Rebirth and show how P-N52 Superman replaced N52 Superman.\n \n \nshit I should explain Rebirth huh\nOk so, New 52. After a while, writers noticed how Snyder and Johns just kinda ignored the reboot and were like \"hey we wanna do that too\" and Johns was like \"fine I'll fix it\" and made like the opposite of a reboot with DC Universe: Rebirth. Where New 52 got rid of everything, Rebirth brought it all back. So the Rebirth universe is New 52 but everything from before Flashpoint happened AND everything from N52 happened and it's all synced up to the N52 timeline (5 [10?] years). Basically, Johns spent 5 years writing a reason to de-age everyone. Except there's one problem. Now there's two Supermen! So, spoilers, N52 Superman dies in 0.2 and P-N52 Superman comes out of hiding to replace him. This is riiight before Rebirth so even though everything that happened happened, everyone remembers N52 Superman in those memories and see P-N52 Superman as a stranger. ok NOW you're ready. If you get bored with 0.1 and 0.2, try skipping to Vol. 1 it's way better.\n  \nAlso read Super Sons sometime after Vol. 2, it's the best.",
  "artist": "Patrick Gleason",
  "author": "Peter J. Tomasi",
  "cover": "https://2.bp.blogspot.com/56TYfJ0XVHqD7BtOlK5_Q749yuiDo_01VbQRpbizm_iIMnDnMvepy1WpnpCSwEUwOEbH12-thekS=s0?rhlupa=MjYwMTo1ODM6ODIwMDo3MmQwOjpmMjFl&rnvuka=TW96aWxsYS81LjAgKFdpbmRvd3MgTlQgMTAuMDsgV2luNjQ7IHg2NCkgQXBwbGVXZWJLaXQvNTM3LjM2IChLSFRNTCwgbGlrZSBHZWNrbykgQ2hyb21lLzEwNi4wLjAuMCBTYWZhcmkvNTM3LjM2",
  "chapters": {
    "1": {
      "title": "Son of Superman",
      "volume": "",
      "last_updated": "1667076831",
      "groups": {
        "": "/proxy/api/imgur/chapter/xiLYMyi"
      }
    },
    "2": {
      "title": "Trials of the Super Son",
      "volume": "",
      "last_updated": "1667076867",
      "groups": {
        "": "/proxy/api/imgur/chapter/oLTTiMl"
      }
    },
    "3": {
      "title": "Multiplicity",
      "volume": "",
      "last_updated": "1667076879",
      "groups": {
        "": "/proxy/api/imgur/chapter/bN957e5"
      }
    },
    "4": {
      "title": "Black Dawn",
      "volume": "",
      "last_updated": "1667077334",
      "groups": {
        "": "/proxy/api/imgur/chapter/YwbFu5C"
      }
    },
    "5": {
      "title": "Hopes and Fears",
      "volume": "",
      "last_updated": "1667077347",
      "groups": {
        "": ""
      }
    },
    "6": {
      "title": "Imperious Lex",
      "volume": "",
      "last_updated": "1667077370",
      "groups": {
        "": ""
      }
    },
    "7": {
      "title": "Bizarroverse",
      "volume": "",
      "last_updated": "1667077379",
      "groups": {
        "": ""
      }
    },
    "0.1": {
      "title": "Lois and Clark",
      "volume": "",
      "last_updated": "1667076352",
      "groups": {
        "": "/proxy/api/imgur/chapter/LPBltDy"
      }
    },
    "0.2": {
      "title": "The Final Days of Superman",
      "volume": "",
      "last_updated": "1667076817",
      "groups": {
        "": "/proxy/api/imgur/chapter/ifih6us"
      }
    },
    "3.5": {
      "title": "Superman Reborn",
      "volume": "",
      "last_updated": "1667077393",
      "groups": {
        "": ""
      }
    }
  }
}