{
  "title": "Superman: Son of Kal-El",
  "description": "This is the current run on Superman. (Alongside Action Comics which focuses on Clark)\n\nJonathan Kent has experienced a lot in his young life. He’s fought evil with Robin, traveled across galaxies with his Kryptonian grandfather, and lived in the future with the Legion of Super-Heroes, who were intent on training him for the day his father could no longer be Superman. There is a hole in the Legion’s history that prevents Jon from knowing exactly when that will happen, but all signs point to it being very soon. It’s time for the son to wear his father’s cape and continue the never-ending battle as a symbol of hope for his home planet. But can Jon be Superman and still have a normal life? The son of Clark Kent and Lois Lane will learn the hard way as he heads to college and combats the dangers of the modern world.\n\nBACKGROUND INFO:\n- Clark is offworld staging an uprising on Warworld, a world ruled by Mongul (starts with Action Comics 1030)\n- Last run (Superman 2018): Bendis came in and stole Superman from Tomasi+Gleason and had Clark reveal that he was Superman at the end. (I didn't read that run because of the next point and haven't read this yet so if it was undone/doesn't affect Lois+Jon, just ignore this)\n- Bendis also aged up Jon and strained Lois' relationship with Clark by having her and Jon go on space adventures with Jor-El! (definitely because he didn't want to write a family [coward]) This is 100% the reason why Super Sons (The Greatest Comic Ever) ended and I will forever hate him for it. (I mean they still have those miniserieses but it's not the same as a current-time ongoing, okay) I don't know if they status-quo'd the relationship (or what status-quo they'd choose) but its good to know.\n\nSo: Clark is offworld, everyone knows who Superman (Clark) is, Jon is not the same Jon as in Superman 2016.",
  "artist": "John Timms",
  "author": "Tom Taylor",
  "cover": "https://readcomicsonline.ru/uploads/manga/superman-son-of-kalel-2021/chapters/1/01.jpg",
  "chapters": {
    "1": {
      "title": "The Truth",
      "volume": "",
      "last_updated": "1668659846",
      "groups": {
        "": ""
      }
    },
    "8.5": {
      "title": "(Nightwing 2016 #89) ",
      "volume": "",
      "last_updated": "1668659891",
      "groups": {
        "": [
          ""
        ]
      }
    },
    "15.5": {
      "title": "(Action Comics #1047) ",
      "volume": "",
      "last_updated": "1668659982",
      "groups": {
        "": ""
      }
    },
    "16.5": {
      "title": "(Action Comics #1048) ",
      "volume": "",
      "last_updated": "1668659997",
      "groups": {
        "": [
          ""
        ]
      }
    },
    "6.5": {
      "title": "(Annual #1) ",
      "volume": "",
      "last_updated": "1668660069",
      "groups": {
        "": [
          ""
        ]
      }
    }
  }
}