{
  "title": "Super Sons",
  "description": "When Robin (Damian Wayne) discovers a connection between a series of mysterious crimes and the aftermath of the bizarre and deadly Amazo Virus, he needs Superboy (Jonathan Kent) to aid in the investigation. But when the duo learn that the teenage Kid Amazo has plans that put the entire Justice League in danger, they need help from an unlikely source: Lex Luthor!\n \nEven if the odd couple of young heroes survive Luthor’s assistance, they’ll have to face a possibly greater threat: the combined forces of Robin’s tutor, Alfred Pennyworth, and Superboy’s mother, Lois Lane!\n \n\nNOTES:\nThe series got cancelled after volume 3 because Bendis, the new (at the time) writer of Superman decided he didn't want to write a little baby boy and aged him up like 7 years. But oh no, big problem. Everyone loves Super Sons. So now they've been releasing miniseries that take place before that and after vol. 3, Adventures/Challenges of the Super Sons, so that's why it seems like it ends in volume 3 (because it did). But it's not the same. I mean it pretty much is but it's not ongoing and takes place in the past. I hate Brian Michael Bendis now. I am tearing down all of my Ultimate Spider-Man posters like Syndrome in The Incredibles. I printed a picture of his bald fucking face and pinned it to a dartboard and I gave him hair with all of the darts I threw. I got a punching bag and printed another picture of his face and taped it to the bag and went to town for hours. I am going to become CEO of DC Comics and Marvel Comics at the SAME TIME just so I can get him blacklisted from the comics industry. It's over for him. He will rue the day he aged up Jonathan Samuel Kent.",
  "artist": "Jorge Jimenez",
  "author": "Peter J. Tomasi",
  "cover": "https://m.media-amazon.com/images/I/91qIif1FbbL.jpg",
  "chapters": {
    "1": {
      "title": "When I Grow Up",
      "volume": "",
      "last_updated": "1667025419",
      "groups": {
        "": "/proxy/api/imgur/chapter/HNjKC5W"
      }
    },
    "2": {
      "title": "Planet of the Capes",
      "volume": "",
      "last_updated": "1667025451",
      "groups": {
        "": "/proxy/api/imgur/chapter/rAMkKyA"
      }
    },
    "3": {
      "title": "Parent Trap",
      "volume": "",
      "last_updated": "1667025581",
      "groups": {
        "": "/proxy/api/imgur/chapter/VKknnQH"
      }
    },
    "4": {
      "title": "Action Detectives",
      "volume": "",
      "last_updated": "1669416221",
      "groups": {
        "": "/proxy/api/imgur/chapter/TnmDci7"
      }
    },
    "5": {
      "title": "Little Monsters",
      "volume": "",
      "last_updated": "1669416257",
      "groups": {
        "": "/proxy/api/imgur/chapter/hQG9X7f"
      }
    },
    "6": {
      "title": "Challenge of the Super Sons",
      "volume": "",
      "last_updated": "1669416268",
      "groups": {
        "": "/proxy/api/imgur/chapter/LvClp8T"
      }
    },
    "2.5": {
      "title": "Super Sons of Tomorrow",
      "volume": "",
      "last_updated": "1667025468",
      "groups": {
        "": "/proxy/api/imgur/chapter/YJS28PN"
      }
    }
  }
}